<template>
  <v-app>
    <div class="layout">
      <div class="header">
        <v-toolbar color="primary">
          <v-btn floating icon @click.prevent="$router.go(-1)" style="z-index: 999">
            <v-icon>arrow_back</v-icon>
          </v-btn>
          <!--<div class="user-agree">-->
            <v-toolbar-title class="black--text">用户协议</v-toolbar-title>
          <!--</div>-->
        </v-toolbar>
      </div>
      <div class="content f-col">
        <div class='title'>蕉庫无人便利店用户协议</div>
        <div>本协议由您与湖南歪空间电子商务有限公司及其子公司（以下简称“歪空间”）共同缔结，本协议具有合同效力。</div>
        <div>本协议中协议双方合称协议方，湖南歪空间电子商务有限公司在协议中亦称为“蕉庫”。</div>
        <div class='subtitle'>一、 协议内容及签署</div>
        <div class='be-bold'>1. 本协议内容包括协议正文及所有蕉庫已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何蕉庫及其关联公司提供的蕉庫盒子24小时自助无人超市服务（以下称为蕉庫盒子）均受本协议约束。</div>
        <div class='be-bold'>2. 您应当在使用蕉庫盒子之前认真阅读全部协议内容。如您对协议有任何疑问，应向蕉庫咨询。但无论您事实上是否在使用蕉庫盒子之前认真阅读了本协议内容，只要您使用蕉庫盒子，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得蕉庫对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</div>
        <div class='be-bold'>3. 您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用蕉庫盒子。</div>
        <div class='be-bold'>4. 蕉庫有权根据需要不时地制订、修改本协议及/或各类规则，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则一经在网站公布后，立即自动生效。如您不同意相关变更，应当立即停止使用蕉庫盒子。若您继续使用蕉庫盒子，即表示您接受经修订的协议。</div>
        <div class='subtitle'>二、 注册</div>
        <div class='sectitle'>1. 注册者资格</div>
        <div>您确认，在您完成注册程序或以其他蕉庫允许的方式实际使用蕉庫盒子时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且蕉庫有权注销（永久冻结）您的蕉庫账户，并向您及您的监护人索偿。</div>
        <div class='sectitle'>2. 账户</div>
        <div>在您签署本协议，完成蕉庫盒子绑定手机号码程序或以其他蕉庫允许的方式实际使用蕉庫盒子时，蕉庫将获取你的微信账号授权，并生成唯一编号的蕉庫账户（以下亦称账户）。</div>
        <div>您可以通过用过微信账号关注蕉庫商城公众号，并绑定手机号码。您绑定的手机号码应当自己实际使用的手机号码，并不得侵犯或涉嫌侵犯他人合法权益。</div>
        <div>您应对您的账户（微信账户）和绑定手机号实施的行为负责。除非有法律规定或司法裁定，且征得蕉庫的同意，否则，账户不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。</div>
        <div>如果发现任何人不当使用您的账户或有任何其他可能危及您的账户安全的情形时，您应当立即以有效方式通知蕉庫，要求蕉庫暂停相关服务。</div>
        <div>您理解蕉庫对您的请求采取行动需要合理时间，蕉庫对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。</div>
        <div>为方便您使用蕉庫盒子及蕉庫关联公司或其他组织的服务（以下称其他服务），您同意并授权蕉庫将您在注册、使用蕉庫盒子过程中，提供、形成的信息传递给向您提供其他服务的蕉庫关联公司或其他组织，或从提供其他服务的蕉庫关联公司或其他组织获取您在注册、使用其他服务期间提供、形成的信息。</div>
        <div class='be-bold'>您不得将蕉庫盒子上的账户借给他人使用，否则用户应承担因此造成的全部责任，并与实际使用人承担连带责任。</div>
        <div class='be-bold'>您同意，蕉庫有权使用用户注册信息、账户名、密码等信息，登入用户账户，进行证据保全，包括但不限于公证、见证等。</div>
        <div class='sectitle'>3. 绑定手机号码</div>
        <div>在您按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后或以其他蕉庫允许的方式实际使用蕉庫盒子时，您即成 为蕉庫盒子用户（亦称用户）。在注册时，您应当按照法律法规要求，或注册页面的提示准确提供，并及时更新您的资料，以使之真实、及时，完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，蕉庫有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部蕉庫盒子。蕉庫对此不承担任何责任，您将承担因此产生的任何直接或间接支出。您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便蕉庫与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用蕉庫盒子过程中产生任何损失或增加费用的，应由您完全独自承担。 您在使用蕉庫盒子过程中，所产生的应纳税赋，以及一切硬件、软件、服务及其它方面的费用，均由您独自承担。</div>
        <div class='subtitle'>三、 蕉庫盒子</div>
        <div>1. 通过蕉庫及其关联公司提供的蕉庫盒子和其它服务，用户可在蕉庫盒子中购买商品并进行实际消费。</div>
        <div>2. 您通过蕉庫盒子的消费过程中，若出现交易纠纷，则蕉庫有权根据单方判断做出调处决定，您了解并同意接受蕉庫的判断和调处决定。该决定将对您具有法律约束力。</div>
        <div>3. 您了解并同意，蕉庫有权应政府部门（包括司法及行政部门）的要求，向其提供您在蕉庫填写的注册信息和交易纪录等必要信息。如您涉嫌侵犯他人权利，则蕉庫亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。</div>
        <div class='subtitle'>四、 蕉庫盒子使用规范</div>
        <div>1. 通过蕉庫使用蕉庫盒子过程中，您承诺遵守以下约定：</div>
        <div> a) 在使用蕉庫盒子过程中实施的所有行为均遵守国家法律、法规等规范性文件及蕉庫各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保蕉庫免于因此产生任何损失。</div>
        <div>b) 在蕉庫盒子中购买交易过程中，遵守诚实信用原则，不采取不正当行为，勿偷盗、利用其他手段避开蕉庫监控，在未支付商品的情况下取走蕉庫盒子内的商品。</div>
        <div>c) 不使用任何装置、软件或例行程序干预或试图干预蕉庫盒子的正常运作。</div>
        <div>2. 您了解并同意：</div>
        <div>a) 蕉庫有权对您是否违反上述承诺做出单方认定，并根据单方认定结果适用规则予以处理或终止向您提供服务，且无须征得您的同意或提前通知予您。</div>
        <div>b) 经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者蕉庫根据自身的判断，认为您的行为涉嫌违反本协议和/或规则的条款或涉嫌违反法律法规的规定的，则蕉庫有权在蕉庫上公示您的该等涉嫌违法或违约行为及蕉庫已对您采取的措施。</div>
        <div>c) 对于您在蕉庫盒子中实施的行为，包括您未在蕉庫盒子中实施但已经对蕉庫及其用户产生影响的行为，蕉庫有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并据此作出相应处罚。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。</div>
        <div>d) 对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保蕉庫盒子免于因此产生损失或增加费用，如蕉庫盒子产生损失或增加费用的。</div>
        <div class='be-bold'>e) 如您涉嫌违反有关法律或者本协议之规定，使蕉庫遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿蕉庫因此造成的损失及（或）发生的费用，包括但不限于合理的律师费用、诉讼费、差旅费等。</div>
        <div class='be-bold'>f) 您在购买蕉庫的任何商品因出现技术上或其他方面的故障，导致商品低于实际销售价或者无需支付对应价款就可以拿走商品情形的，视为双方交易未达成，您应及时中止交易退还商品并联系蕉庫盒子予以解决，如商品已被您使用的，您应当按照商品实际销售价支付价款。</div>
        <div class='subtitle'>五、 特别授权</div>
        <div>您完全理解并不可撤销地授予蕉庫及其关联公司下列权利：</div>
        <div> 1. 一旦您向蕉庫及（或）其关联公司（包括联盟商家）等作出任何形式的承诺，且相关公司已确认您违反了该承诺，则蕉庫有权立即按您的承诺或协议约定的方式对您的账户采取限制措施，包括中止或终止向您提供服务，并公示相关公司确认的您的违约情况。</div>
        <div>2. 您了解并同意，蕉庫无须就相关确认与您核对事实，或另行征得您的同意，且蕉庫无须就此限制措施或公示行为向您承担任何的责任。</div>
        <div>3. 一旦您违反本协议，或与蕉庫签订的其他协议的约定，蕉庫有权以任何方式通知蕉庫关联公司，要求其对您的权益采取限制措施，包括要求关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。</div>
        <div>4. 对于您提供的资料及数据信息，您授予蕉庫及其关联公司独家的、全球通用的、永久的、免费的许可使用权利 (并有权在多个层面对该权利进行再授权)。</div>
        <div>5. 此外，蕉庫及其关联公司有权(全部或部份地)使用、复制、修订、改写、发布、翻译、分发、执行和展示您的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于蕉庫的各类信息）或制作其派生作品，并以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内。</div>
        <div class='be-bold'>6. 您一旦接受本协议，即表明您主动将使用蕉庫盒子过程中产生的肖像权或在蕉庫用户论坛社区产生的著作权等一切可转让的财产权等全部独家且不撤销地转让给蕉庫所有，您同意蕉庫有权就任何主体侵权而提起诉讼。</div>
        <div class='subtitle'>六、责任范围和责任限制</div>
        <div>1. 蕉庫负责按"现状"和"可得到"的状态向您提供蕉庫盒子。但蕉庫对蕉庫盒子不作任何明示或暗示的保证，包括但不限于蕉庫盒子的适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。</div>
        <div>2. 同时，蕉庫也不对蕉庫盒子所涉及的技术及信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性作出任何承诺和保证。</div>
        <div>3. 您所购买的蕉庫盒子内的商品，均由蕉庫精心挑选，并且蕉庫将保证其商品质量、安全性或合法性。</div>
        <div class='subtitle be-bold'> 七、 法律管辖和适用</div>
        <div class='be-bold'>1. 本协议订立、执行和解释及争议的解决均适用中华人民共和国大陆地区适用之有效法律。</div>
        <div class='be-bold'>2. 如您就本协议内容及执行发生任何争议，双方应尽力协商解决；协商不成时，任何一方均有权向协议签订地人民法院提起诉讼。本协议协议签订地为湖南省长沙市天心区。</div>
      </div>
    </div>
  </v-app>
</template>

<script>
    export default {
        name: "user-agreement"
    }
</script>

<style scoped>
  .content {
    font-size: 14px;
    padding: 5px 20px 20px;
  }
  .title {
    font-size: 20px;
    font-weight: bold;
    line-height: 40px;
    text-align: center;
    margin: 10px auto;
  }
  .subtitle {
    /* padding: 10rpx 0; */
  }
  .be-bold {
    font-weight: bold;
  }
  .header .toolbar{
    box-shadow: none;
    position: relative;
  }
  .black--text{
    position: absolute;
    width: 100%;
    margin: 0 auto;
    text-align: center;
  }
  /*.user-agree{*/
    /*text-align: center;*/
    /*width: 100%;*/
  /*}*/
  /*.toolbar__title{*/
    /*margin-left: 0px !important;*/
  /*}*/
</style>
